###
Вариант: 10
Текст задачи: даны самые популярные репозитории на github https://habr.com/ru/post/453444/, 
по последней цифре зачетки получить JSON для вашего варианта .
Программа с графическим интерфейсом вводим в поле имя репозитория и по нажатию кнопки получаем результат.
Необходимо получить в новый файл следующую информацию:
"company": None,
'created_at': '2015-08-09T17:55:43Z',
'email': None,
"id": 1362940,
'name': 'Kubernetes',
"url": "https://api.github.com/users/kubernetes"}
Все прикрепить одним архивом.
###
